{
  "title": "تایید دو مرحله ای",
  "intro.title": "تایید دو مرحله ای چیست؟",
  "disabled": "غیر فعال است",
  "enabled": "فعال است",
  "second-factor-required": "برای دسترسی به این صفحه تایید دو مرحله ای نیاز است",

  "notification.backupCode.generated": "مجموعه ای از کد های پشتیبان برای حساب کاربری ایجاد شد.",
  "notification.backupCode.used": "یک کد پشتیبان برای ورود به این حساب کاربری استفاده شد",

  "user.intro.one": "علاوه بر احراز هویت از طریق نام کاربری و رمز عبور، لایه امنیتی دیگری قابل تنظیم است که اجازه دسترسی به حساب کاربری تنها در صورت ارائه رمز یکبار مصرف داده می شود. این رمز معمولا بر روی تلفن های همراه ایجاد و ذخیره می شود.",
  "user.intro.two": "برای فعال سازی تایید دو مرحله ای، دکمه زیر را به منظور ایجاد توکن برای حساب کاربری بزنید. سپس آن را با تلفن همراه خود بوسیله برنامه Google Authenticator یا موارد مشابه اسکن کنید. در آخر به منظور تایید، کد تاییدی که در لحظه برای شما ایجاد می شود را داخل صفحه تایید وارد کنید.",
  "user.intro.three": "بعد از تنظیم تایید دو مرحله ای، ورود به حساب کاربری تنها در صورت ارائه رمز عبور و رمز یکبار مصرف امکان پذیر است.",
  "user.settings.title": "تنظیمات تایید دو مرحله ای",
  "user.settings.enable": "فعال کردن تایید دو مرحله ای",
  "user.settings.disable": "غیرفعال کردن تایید دو مرحله ای",
  "user.settings.generateBackupCodes": "ایجاد کدهای پشتیبان",
  "user.force_2fa": "به دلایل امنیتی، مدیر شما را ملزم به فعال کردن تایید دو مرحله ای کرده است",

  "generate.title": "ایجاد توکن و اتصال دستگاه",
  "generate.text": "کد QR ای که بالا نمایش داده شده امکان اتصال دستگاه تلفن همراه شما (به کمک برنامه Google Authenticator یا موارد مناسب دیگر) به حساب کاربری شما در انجمن را فراهم می سازد. کد را با برنامه اسکن کنید و توکن ایحاد شده را تایید کنید.",
	"generate.manual-entry": "If you wish to add your token manually, you can do so with the encoded key below:",
  "generate.safety.title": "این توکن را در اختیار کسی نگذارید! دیگران قادر به استفاده از آن برای اتصال دستگاه به حساب کاربری شما می باشند.",
  "generate.safety.text": "به دلایل امنیتی، کد QR فقط اینجا قابل مشاهده خواهد بود. در صورت از دست دادن تلفن همراه یا در دسترس نبودن آن، شما قادر به ورود به حساب کاربری خود نخواهید بود مگر آنکه تایید دو مرحله ای در حساب کاربری شما غیرفعال شود.",
  "generate.success": "تایید دو مرحله ای با موفقیت فعال شد!",

  "disable.confirm": "آیا مطمئن هستید می خواهید تایید دو مرحله ای را غیرفعال کنید؟",

  "login.text": "کد تایید ایجاد شده توسط برنامه تلفن همراه تان را وارد کنید.",
  "login.verify": "تایید",
  "login.failure": "کد تایید وارد شده صحیح نمی باشد.",
  "login.use_backup": "استفاده از کد های پشتیبان",

  "backup.text": "یکی از کد های پشتیبان خود را وارد نمایید.",
  "backup.failure": "کد پشتیبان وارد شده صحیح نمی باشد",
  "backup.use_code": "استفاده از کد تایید",
  "backup.generate.title": "ایجاد کدهای پشتیبان جدید",
  "backup.generate.one": "این کد های پشتیبان به منظور دسترسی دوباره به حساب کاربری در صورت از دست دادن یا آسیب دیدن دستگاه تلفن همراه شما ایجاد شده اند.",
  "backup.generate.two": "کد های پشتیبان شما در پایین نمایش داده شده است و دیگر قابل مشاهده نخواهد بود. آن ها را جایی امن نگه داری و حفظ کنید!"
}
