{
	"title": "2FA Авторизация",
	"intro.title": "Что такое двухфакторная аутентификация (2FA)?",
	"disabled": "Отключенный",
	"enabled": "Включенный",
	"second-factor-required": "Для доступа к этому ресурсу требуется двухфакторная аутентификация",

	"notification.backupCode.generated": "Для этой учетной записи только что был сгенерирован набор резервных кодов.",
	"notification.backupCode.used": "Резервный код был только что использован для входа в эту учетную запись",

	"user.force_2fa": "Администратор потребовал, чтобы вы настроили 2FA для своей учетной записи в целях безопасности",

	"user.intro.one": "В дополнение к обычной аутентификации с помощью имени пользователя/пароля или единого входа можно настроить второй уровень безопасности, разрешающий доступ только в том случае, если указан одноразовый пароль, основанный на времени, обычно генерируемый / сохраняемый на мобильном устройстве.",
	"user.intro.two": "Чтобы включить двухфакторную аутентификацию, выберите метод настройки, приведенный ниже. При настройке с помощью приложения authenticator отсканируйте прилагаемый QR-код и повторно введите токен, основанный на времени, чтобы подтвердить настройку. Если настройка выполняется с помощью аппаратного ключа, зарегистрируйте свое устройство и подпишите представленный запрос, чтобы продолжить.",
	"user.intro.three": "После настройки попытки входа в систему не будут продолжены до тех пор, пока не будут введены пароль и одноразовый токен/вызов.",
	"user.setup.types": "Поддерживаются два типа аутентификации по второму фактору: токен, основанный на времени, с помощью приложения-аутентификатора или аппаратный токен с помощью ключа, поддерживаемого U2F. Пожалуйста, выберите, какую стратегию вы хотели бы настроить:",
	"user.setup.enableTOTP": "<i class=\"fa fa-2x fa-mobile\"></i><br />Настройка с помощью приложения authenticator",
	"user.setup.enableU2F": "<i class=\"fa fa-2x fa-key\"></i><br />Настройка с помощью аппаратного ключа",

	"user.manage.lead": "Управляйте своими методами двухфакторной аутентификации здесь.",
	"user.manage.enable": "Включить",
	"user.manage.disable": "Выключить",
	"user.manage.generate": "Создать",
	"user.manage.regenerate": "Пересоздать",
	"user.manage.disableTotp": "Вы уверены, что хотите отключить свое приложение для проверки подлинности?",
	"user.manage.disableAuthn": "Вы уверены, что хотите отсоединить свой аппаратный ключ?",

	"generate.title": "Сгенерировать токен и настроить устройство",
	"generate.text": "Показанный выше QR-код позволит вам связать ваше мобильное устройство (через приложение Authenticator или подходящий вариант) с вашей учетной записью на этом веб-сайте. Просто отсканируйте его через приложение и введите сгенерированный токен для подтверждения.",
	"generate.manual-entry": "Если вы хотите добавить свой токен вручную, вы можете сделать это с помощью приведенного ниже закодированного ключа:",
	"generate.safety.title": "Храните этот токен в безопасности! Другие пользователи могут использовать его для регистрации своих устройств под вашей учетной записью.",
	"generate.safety.text": "В целях безопасности QR-код будет показан только здесь. В случае, если ваше устройство будет утеряно или иным образом недоступно, вы не сможете войти в NodeBB, пока 2FA не будет деактивирован в вашей учетной записи.",
	"generate.success": "Успешно включена двухфакторная аутентификация!",

	"choices.lead": "Пожалуйста, выберите метод второго фактора, с помощью которого вы хотите пройти аутентификацию.",
	"choices.back": "Вернуться к выбору",
  "choices.logout": "Выйти из аккаунта",
	"choices.authn": "Аппаратный ключ (например, Yubikey, Titan и т.д.)",
	"choices.totp": "Приложение Authenticator (например, Google Authenticator, Authy, FreeOTP и т.д.)",
	"choices.backupCode": "Резервный код",

	"authn.modal.content": "Отправлен запрос на регистрацию вашего аппаратного ключа, пожалуйста, пройдите аутентификацию, активировав ключ сейчас<br /><br /><i class=\"fa fa-spinner fa-spin\"></i>",
	"authn.error": "Регистрация аппаратного ключа прервана.",
	"authn.success": "Аппаратный ключ успешно зарегистрирован.",
	"authn.login.lead": "Пожалуйста, активируйте свой аппаратный ключ прямо сейчас.",
	"authn.login.info": "Эта учетная запись защищена двухфакторной аутентификацией с помощью физического ключа. Если у вас есть ключ от этой учетной записи, пожалуйста, активируйте его сейчас, нажав кнопку на ключе.",
	"authn.login.error": "Мы не можем проверить целостность этого ключа, пожалуйста, используйте резервный код для входа в систему и повторно зарегистрируйте этот ключ в своей учетной записи.",

	"login.text": "Введите проверочный код, сгенерированный вашим мобильным приложением.",
	"login.verify": "Проверить",
	"login.failure": "Проверочный код, который вы ввели, неверен",
	"login.use_backup": "Используйте резервный код",

	"backup.text": "Введите один из ваших резервных кодов.",
	"backup.failure": "Код резервной копии, который вы ввели, неверен",
	"backup.use_code": "Используйте проверочный код",
	"backup.generate.title": "Сгенерировать новые резервные коды",
	"backup.generate.one": "Эти резервные коды были сгенерированы для того, чтобы помочь вам восстановить доступ к вашей учетной записи в случае утери или повреждения вашего устройства аутентификации (обычно мобильного телефона).",
	"backup.generate.two": "Ваши коды указаны ниже и больше показываться не будут. Запишите их на листке бумаги и закрепите его!",

	"admin.intro.one": "<strong> Двухфакторная аутентификация</strong> (2FA) - это протокол безопасности, который работает путем добавления второго уровня аутентификации перед предоставлением доступа. Как правило, этими двумя уровнями являются \"что-то, что вы знаете\" (например, ваш пароль) и \"что-то, что у вас есть\" (например, токен, сгенерированный вашим мобильным устройством). Этот плагин вводит второй уровень безопасности, позволяющий пользователям включать и подключать свои телефоны или другие подходящие устройства к протоколам аутентификации вашего форума.",
	"admin.intro.two": "Пока этот плагин активен, пользователи смогут увидеть новый пункт меню профиля под названием \"Двухфакторная аутентификация\". Они смогут настроить свои токены с этой страницы.",
	"admin.users.title": "Пользователи с двухфакторной аутентификацией",
	"admin.users.text": "Следующие пользователи включили двухфакторную аутентификацию:",
	"admin.users.none": "Нет пользователей...",
	"admin.deactivate.title": "Деактивировать токены по пользователю",
	"admin.deactivate.text": "В случае, если пользователь потеряет устройство, содержащее его приложение для двухфакторной аутентификации, он может обратиться к вам, чтобы восстановить доступ к своей учетной записи. Как только вы убедитесь, что они те, за кого себя выдают, вы можете отключить двухфакторную аутентификацию в их учетной записи, введя здесь их имя пользователя.",
	"admin.deactivate.search": "Ищите пользователей здесь...",

	"admin.force_2fa": "Принудительная двухфакторная аутентификация",
	"admin.force_2fa.help": "Принудительно активируйте 2FA у пользователей, принадлежащих к выбранным группам. <br /><small>Это полезно для повышения безопасности, гарантируя, что у привилегированных пользователей, таких как администраторы и модераторы, эта функция активирована.</small>"
}
