{
	"title": "Two-Factor Authentication",
	"intro.title": "What is Two-Factor Authentication (2FA)?",
	"disabled": "Disabled",
	"enabled": "Enabled",
	"second-factor-required": "Two-Factor Authentication is required to access this resource",

	"notification.backupCode.generated": "A set of backup codes have just been generated for this account.",
	"notification.backupCode.used": "A backup code was just used to log into this account",

	"user.intro.one": "In addition to regular authentication via username/password or SSO, a second layer of security can be configured, permitting access only if a time-based one-time password is supplied, typically generated/stored on a mobile device.",
	"user.intro.two": "To enable Two-Factor Authentication, click the button below to generate a token for NodeBB. Once generated, scan it into your mobile device via the GAuthenticator (or another similar app). Lastly, confirm setup by entering the current time-based password into the confirmation screen.",
	"user.intro.three": "Once setup, login attempts will not proceed until both the password and one-time token is supplied.",
	"user.settings.title": "Two-Factor Authentication Settings",
	"user.settings.enable": "Enable Two-Factor Authentication",
	"user.settings.disable": "Disable Two-Factor Authentication",
	"user.settings.generateBackupCodes": "Generate Backup Codes",

	"generate.title": "Generate Token &amp; Set up Device",
	"generate.text": "The QR code shown above will allow you to associate your mobile device (via the GAuthenticator app or a suitable variant) with your account on this website. Simply scan it via the app, and key in the generated token to confirm.",
	"generate.safety.title": "Keep this token safe! Others can use it to register their devices with your account.",
	"generate.safety.text": "For security purposes, the QR code will only be shown here. In the event your device is lost or is otherwise unavailable, you will not be able to log into NodeBB unless 2FA is deactivated on your account.",
	"generate.success": "Successfully enabled Two-Factor Authentication!",

	"disable.confirm": "Are you sure you wish to disable Two-Factor Authentication?",

	"login.text": "Enter the verification code generated by your mobile application.",
	"login.verify": "Verify",
	"login.failure": "The verification code you&apos;ve entered is not correct",
	"login.use_backup": "Use a backup code",

	"backup.text": "Enter one of your backup codes.",
	"backup.failure": "The backup code you&apos;ve entered is not correct",
	"backup.use_code": "Use a verification code",
	"backup.generate.title": "Generate new Backup Codes",
	"backup.generate.one": "These backup codes have been generated in order to help you re-gain access to your account in the event your authentication device (typically a mobile phone) is lost or damaged.",
	"backup.generate.two": "Your codes are shown below, and will not be shown again. Write them down on a piece of paper and secure it!",

	"admin.intro.one": "<strong>Two-Factor Authentication</strong> (2FA) is a security protocol that works by adding a second layer of authentication before granting access. Typically, these two layers are \"something you know\" (e.g. your password), and \"something you have\" (e.g. a token generated by your mobile device). This plugin introduces the second layer of security allowing users to enable and pair their phones or other suitable devices to your forum's authentication protocols.",
	"admin.intro.two": "While this plugin is active, users will be able to see a new profile menu item called \"Two-Factor Authentication\". They will be able to set up their tokens from this page.",
	"admin.users.title": "Two-Factor Authentication Users",
	"admin.users.text": "The following users have enabled Two-Factor Authentication:",
	"admin.users.none": "No users...",
	"admin.deactivate.title": "Deactivate Tokens by User",
	"admin.deactivate.text": "In the event a user loses the device containing their two-factor authentication application, they may come to you to regain access to their account. Once you are sure they are who they say they are, you can disable Two-Factor Authentication on their account by typing their username here.",
	"admin.deactivate.search": "Search for users here..."
}
