{
	"title": "Two-Factor Authentication",
	"intro.title": "What is Two-Factor Authentication (2FA)?",
	"disabled": "Disabled",
	"enabled": "Enabled",
	"second-factor-required": "Two-Factor Authentication is required to access this resource",

	"notification.backupCode.generated": "A set of backup codes have just been generated for this account.",
	"notification.backupCode.used": "A backup code was just used to log into this account",
	"notification.failure": "Someone attempted to access your account but could not pass the second factor.",

	"user.force_2fa": "The administrator has required you to setup 2FA for your account for security purposes",

	"user.intro.one": "In addition to regular authentication via username/password or SSO, a second layer of security can be configured, permitting access only if a time-based one-time password is supplied, typically generated/stored on a mobile device.",
	"user.intro.two": "To enable Two-Factor Authentication, select a setup method below. If setting up via authenticator app, scan the supplied QR code and re-enter the time-based token in order to confirm setup. If setting up via hardware key, register your device and sign the challenge presented to continue.",
	"user.intro.three": "Once setup, login attempts will not proceed until both the password and one-time token/challenge is supplied.",
	"user.setup.types": "Two types of second factor authentication are supported, a time-based token via an authenticator app, or a hardware-based token via a U2F supported key. Please select which strategy you'd like to set up:",
	"user.setup.enableTOTP": "<i class=\"fa fa-2x fa-mobile\"></i><br />Set up via authenticator app",
	"user.setup.enableU2F": "<i class=\"fa fa-2x fa-key\"></i><br />Set up via hardware key",

	"user.manage.lead": "Manage your Two-Factor Authentication methods here.",
	"user.manage.enable": "Enable",
	"user.manage.disable": "Disable",
	"user.manage.generate": "Generate",
	"user.manage.regenerate": "Regenerate",
	"user.manage.disableTotp": "Are you sure you wish to dissociate your authenticator app?",
	"user.manage.disableAuthn": "Are you sure you wish to dissociate your hardware key?",

	"generate.title": "Generate Token &amp; Set up Device",
	"generate.text": "The QR code shown above will allow you to associate your mobile device (via the Authenticator app or a suitable variant) with your account on this website. Simply scan it via the app, and key in the generated token to confirm.",
	"generate.manual-entry": "If you wish to add your token manually, you can do so with the encoded key below:",
	"generate.safety.title": "Keep this token safe! Others can use it to register their devices with your account.",
	"generate.safety.text": "For security purposes, the QR code will only be shown here. In the event your device is lost or is otherwise unavailable, you will not be able to log into NodeBB unless 2FA is deactivated on your account.",
	"generate.success": "Successfully enabled Two-Factor Authentication!",

	"choices.lead": "Please select the second-factor method you wish to authenticate with.",
	"choices.back": "Back to choices",
	"choices.logout": "Logout",
	"choices.authn": "Hardware key (e.g. Yubikey, Titan, etc.)",
	"choices.totp": "Authenticator App (e.g. Google Authenticator, Authy, FreeOTP, etc.)",
	"choices.backupCode": "Backup code",

	"authn.modal.content": "A request to register your hardware key has been sent, please authenticate by activating the key now<br /><br /><i class=\"fa fa-spinner fa-spin\"></i>",
	"authn.error": "Hardware key registration aborted.",
	"authn.success": "Hardware key successfully registered.",
	"authn.login.lead": "Please activate your hardware key now.",
	"authn.login.info": "This account is protected by two-factor authentication via a physical key. If you own the key for this account, please activate it now by pressing the button on the key.",
	"authn.login.error": "We cannot validate the integrity of this key, please use a backup code to log in, and re-register this key with your account.",

	"login.text": "Enter the verification code generated by your mobile application.",
	"login.verify": "Verify",
	"login.failure": "The verification code you&apos;ve entered is not correct",
	"login.use_backup": "Use a backup code",

	"backup.text": "Enter one of your backup codes.",
	"backup.failure": "The backup code you&apos;ve entered is not correct",
	"backup.use_code": "Use a verification code",
	"backup.generate.title": "Generate new Backup Codes",
	"backup.generate.one": "These backup codes have been generated in order to help you re-gain access to your account in the event your authentication device (typically a mobile phone) is lost or damaged.",
	"backup.generate.two": "Your codes are shown below, and will not be shown again. Write them down on a piece of paper and secure it!",

	"failureInfo.lead": "If you are on this page, then you may be wondering what this notification means.",
	"failureInfo.when": "We processed a login attempt at %1 on %2, and as your account is configured with a second factor, issued a second-factor challenge.",
	"failureInfo.explanation": "The user who attempted this login did not successfully pass that second factor, which is why you have been notified. If this was you, then you can safely disregard this message.",
	"failureInfo.remediation": "However — if this was not you, then it is likely that whoever attempted to access your account <strong>has your password, and so your password is now compromised</strong>. <a href=\"../me/edit/password\">You should change your password immediately</a>.",
	"failureInfo.cta": "Change your password &rarr;",

	"admin.intro.one": "<strong>Two-Factor Authentication</strong> (2FA) is a security protocol that works by adding a second layer of authentication before granting access. Typically, these two layers are \"something you know\" (e.g. your password), and \"something you have\" (e.g. a token generated by your mobile device). This plugin introduces the second layer of security allowing users to enable and pair their phones or other suitable devices to your forum's authentication protocols.",
	"admin.intro.two": "While this plugin is active, users will be able to see a new profile menu item called \"Two-Factor Authentication\". They will be able to set up their tokens from this page.",
	"admin.users.title": "Two-Factor Authentication Users",
	"admin.users.text": "The following users have enabled Two-Factor Authentication:",
	"admin.users.none": "No users...",
	"admin.deactivate.title": "Deactivate Tokens by User",
	"admin.deactivate.text": "In the event a user loses the device containing their two-factor authentication application, they may come to you to regain access to their account. Once you are sure they are who they say they are, you can disable Two-Factor Authentication on their account by typing their username here.",
	"admin.deactivate.search": "Search for users here...",

	"admin.force_2fa": "Enforce 2factor Authentication",
	"admin.force_2fa.help": "Force the users belonging to the selected groups to activate 2FA. <br /><small>This is useful to enhance security by ensuring privileged users such as administrators and moderators have this activated.</small>"
}
